<?php

namespace Database\Seeders;

use App\Models\Video;
use Illuminate\Database\Seeder;

class VideoTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Video::insert([
            [
                'title' => 'الاستشراق بين صورتين قناة تواصل أم أداة صراع',
                'desc' => 'محاضرة ألقاها معالي الدكتور "علي بن إبراهيم النملة" تناول فيها نظرة متوازنة وسطية عن أهداف الاستشراق، ومقاصده الخفية، وما ساهم به في خدمة التراث الإسلامي، كما أجمل المحاضر عرض آراء الرافضيين للمستشرقين عمومًا، والمنبهرين بهم واختار منهج الوسط والاعتدال في تقييم ظاهرة الاستشراق وأبعادها.',
                'url' => 'https://youtu.be/ouwdwzNWC1M',
            ],
            [
                'title' => 'هاجس المؤامرة (5)',
                'desc' => 'محاضرة ألقاها معالي الدكتور "علي بن إبراهيم النملة" عن أزمة المؤامرة في العقل العربي، حيث تأتي هذه المحاضرة على هيئة وقفات نقاشية لطرفين متناقضين في موقفهما من مفهوم المؤامرة، أحدهما يثبتها إلى درجة التهويل من تأثيرها على الأمم، فهي عندهم حقيقة واقعة، والآخر ينفيها نفيًا مطلقًا ويسعى إلى تسويغ ما يظهر من أحداث تتناسب مع هذا المفهوم على أنه بفعل الناس أنفسهم ومن داخلهم، فهي عندهم وهم مصطنع يوحي بحالة مرضية مزمنة تصل إلى الهوس. كما تسعى هذه الوقفات إلى البحث عن المنهج الوسط بين موقفين متطرفين، فيثبت هذا المنهج وجود المفهوم، لكنه لا يرمي عليه كل التدابير، ولا يغفل القدرات الذاتية في الإسهام في وجود المشكلات والإسهام كذلك في التغلب عليها بفطنة وكياسة وتثبّت.',
                'url' => 'https://youtu.be/tFkIBm9XqZo',
            ],
            [
                'title' => 'هاجس المؤامرة (4)',
                'desc' => 'محاضرة ألقاها معالي الدكتور "علي بن إبراهيم النملة" عن أزمة المؤامرة في العقل العربي، حيث تأتي هذه المحاضرة على هيئة وقفات نقاشية لطرفين متناقضين في موقفهما من مفهوم المؤامرة، أحدهما يثبتها إلى درجة التهويل من تأثيرها على الأمم، فهي عندهم حقيقة واقعة، والآخر ينفيها نفيًا مطلقًا ويسعى إلى تسويغ ما يظهر من أحداث تتناسب مع هذا المفهوم على أنه بفعل الناس أنفسهم ومن داخلهم، فهي عندهم وهم مصطنع يوحي بحالة مرضية مزمنة تصل إلى الهوس. كما تسعى هذه الوقفات إلى البحث عن المنهج الوسط بين موقفين متطرفين، فيثبت هذا المنهج وجود المفهوم، لكنه لا يرمي عليه كل التدابير، ولا يغفل القدرات الذاتية في الإسهام في وجود المشكلات والإسهام كذلك في التغلب عليها بفطنة وكياسة وتثبّت.',
                'url' => 'https://youtu.be/K6zXiMkrRMs',
            ],
            [
                'title' => 'هاجس المؤامرة (3)',
                'desc' => 'محاضرة ألقاها معالي الدكتور "علي بن إبراهيم النملة" عن أزمة المؤامرة في العقل العربي، حيث تأتي هذه المحاضرة على هيئة وقفات نقاشية لطرفين متناقضين في موقفهما من مفهوم المؤامرة، أحدهما يثبتها إلى درجة التهويل من تأثيرها على الأمم، فهي عندهم حقيقة واقعة، والآخر ينفيها نفيًا مطلقًا ويسعى إلى تسويغ ما يظهر من أحداث تتناسب مع هذا المفهوم على أنه بفعل الناس أنفسهم ومن داخلهم، فهي عندهم وهم مصطنع يوحي بحالة مرضية مزمنة تصل إلى الهوس. كما تسعى هذه الوقفات إلى البحث عن المنهج الوسط بين موقفين متطرفين، فيثبت هذا المنهج وجود المفهوم، لكنه لا يرمي عليه كل التدابير، ولا يغفل القدرات الذاتية في الإسهام في وجود المشكلات والإسهام كذلك في التغلب عليها بفطنة وكياسة وتثبّت.',
                'url' => 'https://youtu.be/3HIMiLo1a_E',
            ],
            [
                'title' => 'هاجس المؤامرة (2)',
                'desc' => 'محاضرة ألقاها معالي الدكتور "علي بن إبراهيم النملة" عن أزمة المؤامرة في العقل العربي، حيث تأتي هذه المحاضرة على هيئة وقفات نقاشية لطرفين متناقضين في موقفهما من مفهوم المؤامرة، أحدهما يثبتها إلى درجة التهويل من تأثيرها على الأمم، فهي عندهم حقيقة واقعة، والآخر ينفيها نفيًا مطلقًا ويسعى إلى تسويغ ما يظهر من أحداث تتناسب مع هذا المفهوم على أنه بفعل الناس أنفسهم ومن داخلهم، فهي عندهم وهم مصطنع يوحي بحالة مرضية مزمنة تصل إلى الهوس. كما تسعى هذه الوقفات إلى البحث عن المنهج الوسط بين موقفين متطرفين، فيثبت هذا المنهج وجود المفهوم، لكنه لا يرمي عليه كل التدابير، ولا يغفل القدرات الذاتية في الإسهام في وجود المشكلات والإسهام كذلك في التغلب عليها بفطنة وكياسة وتثبّت.',
                'url' => 'https://youtu.be/AEOD2fDoOGQ',
            ],
            [
                'title' => 'هاجس المؤامرة (1)',
                'desc' => 'محاضرة ألقاها معالي الدكتور علي بن إبراهيم النملة عن أزمة المؤامرة في العقل العربي، حيث تأتي هذه المحاضرة على هيئة  وقفات نقاشية لطرفين متناقضين في موقفهما من مفهوم المؤامرة، أحدهما يثبتها إلى درجة التهويل من تأثيرها على الأمم، فهي عندهم حقيقة واقعة، والآخر ينفيها نفيًا مطلقًا ويسعى إلى تسويغ ما يظهر من أحداث تتناسب مع هذا المفهوم على أنه بفعل الناس أنفسهم ومن داخلهم، فهي عندهم وهم مصطنع يوحي بحالة مرضية مزمنة تصل إلى الهوس.



                كما تسعى هذه الوقفات إلى البحث عن المنهج الوسط بين موقفين متطرفين، فيثبت هذا المنهج وجود المفهوم، لكنه لا يرمي عليه كل التدابير، ولا يغفل القدرات الذاتية في الإسهام في وجود المشكلات والإسهام كذلك في التغلب عليها بفطنة وكياسة وتثبّت.',
                'url' => 'https://youtu.be/mzU21qGUk6U',
            ],
            [
                'title' => 'المستشرقون والقرآن الكريم',
                'desc' => 'اللقاء العلمي 137 لجمعية تبيان في الرياض بعنوان: المستشرقون والقرآن الكريم لمعالي الأستاذ الدكتور/ علي بن إبراهيم النملة، يتناول فيه المحاضر تقويم لدراسات المستشرقين للقرآن الكريم وترجماتهم، ويبين أن من تعرض لنص القرآن الكريم من المستشرقين والعلماء الغربيين بلغته العربية كانت له مواقف أكثر نزاهة ممن تعرضوا للنص القرآني مترجماً من مستشرقين.',
                'url' => 'https://youtu.be/m4O8h7VcACw',
            ],
            [
                'title' => 'استشراق أم استغراب',
                'desc' => 'محاضرة ألقاها معالي الأستاذ الدكتور علي بن إبراهيم النملة في ديوانية الشيخ د.أحمد بن عبالعزيز الحمدان، تناول فيها مصطلح الاستشراق في ثقافتنا الإسلامية، ماذا يقصد به، وتاريخه، وأهداف ومقاصد الاستشراق، وتقييم مواقف المستشرقين من الثقافة الإسلامية وإسهاماتهم فيها.',
                'url' => 'https://youtu.be/wn2zDvIAJfE',
            ],
            [
                'title' => 'نحو عمل خيري متميز',
                'desc' => 'محاضرة ألقاها معالي الدكتور على النملة عن "العمل الخيري في المملكة (الواقع وتطلعات)" ضمن إطار فعاليات ملتقى التجارب المميّزة للجمعيات الخيريَّة السعوديَّة الذي تنظمه عمادة خدمة المجتمع والتَّعليم المستمر تحت شعار (نحو عمل خيري متميز)؛ تحدَّث خلالها عن واقعِ الجمعيات الخيرية في المملكة والتطلعات التي يأمل في تحقيقها.',
                'url' => 'https://youtu.be/zwGUh91d7f4',
            ],
            [
                'title' => 'المؤامرة بين التهويل والتهوين',
                'desc' => 'محاضرة ألقاها معالي الدكتور على النملة يرى فيها أن نظرية المؤامرة من أكبر آفات العقل العربي الحالية؛ حيث تناولت هذه المحاضرة وقفات بيانية على هيئة مناقشات لطرفين متناقضين في موقفهما من مفهوم المؤامرة، أحدهما يثبتها إلى درجة التهويل من تأثيرها على الأمم، فهي عندهم حقيقة واقعة، والآخر ينفيها نفيًا مطلقًا ويسعى إلى تسويغ ما يظهر من أحداث تتناسب مع هذا المفهوم على أنه بفعل الناس أنفسهم ومن داخلهم، فهي عندهم وهم مصطنع يوحي بحالة مرضية مزمنة تصل إلى الهوس. كما تسعى هذه الوقفات إلى البحث عن المنهج الوسط بين موقفين متطرفين، فيثبت هذا المنهج وجود المفهوم، لكنه لا يرمي عليه كل التدابير، ولا يغفل القدرات الذاتية في الإسهام في وجود المشكلات والإسهام كذلك في التغلب عليها بفطنة وكياسة وتثبّت.',
                'url' => 'https://youtu.be/-4D22DxDJ5g',
            ],
        ]);
    }
}
